app/Http/Controllers/Frontend/IndexController.php

select * from `blogs` where `status` = 1 limit 6 offset 0
select count(*) as aggregate from `blogs` where `status` = 1
---
    public function blog()
    {
        $page_title             = __("Blogs");
        $blogs                  = Blog::where('status', true)->paginate(6);