app/Http/Controllers/Admin/ContactMessageController.php

select * from `contact_requests` order by `id` desc limit 15 offset 0
select count(*) as aggregate from `contact_requests`
---
    public function index()
    {
        $page_title = __("Contact Messages");
        $contact_requests = ContactRequest::orderByDesc("id")->paginate(15);