app/Http/Controllers/Admin/DashboardController.php

select count(*) as aggregate from `users`
select count(*) as aggregate from `users` where `email_verified` = 0
select count(*) as aggregate from `users` where `status` = 1
select count(*) as aggregate from `users` where `status` = 0
select count(*) as aggregate from `doctors`
select count(*) as aggregate from `doctors` where `status` = 1
select count(*) as aggregate from `doctors` where `status` = 0
---
    public function index()
    {


        $page_title         = "Dashboard";
        $last_month_start   = date('Y-m-01', strtotime('-1 month', strtotime(date('Y-m-d'))));
        $last_month_end     = date('Y-m-31', strtotime('-1 month', strtotime(date('Y-m-d'))));
        $this_month_start   = date('Y-m-01');
        $this_month_end     = date('Y-m-d');

        $total_users     = (User::toBase()->count() == 0) ? 1 : User::toBase()->count();
        $unverified_user = User::toBase()->where('email_verified', 0)->count();
        $active_user     = User::toBase()->where('status', true)->count();
        $banned_user     = User::toBase()->where('status', false)->count();
        $user_percent    = (($active_user * 100) / $total_users);

        if ($user_percent > 100) {
            $user_percent = 100;
        }

        $total_doctors     = (Doctor::toBase()->count() == 0) ? 1 : Doctor::toBase()->count();
        $active_doctor     = Doctor::toBase()->where('status', true)->count();
        $pending_doctor    = Doctor::toBase()->where('status', false)->count();

select count(*) as aggregate from `doctor_bookings`
select count(*) as aggregate from `doctor_bookings` where `status` = 2
select count(*) as aggregate from `doctor_bookings` where `status` = 1
---

        $total_bookings     = (DoctorBooking::toBase()

            ->count() == 0) ? 1 : DoctorBooking::toBase()->count();
        $pending_booking    = DoctorBooking::toBase()->where('status', global_const()::STATUS_PENDING)->count();
        $confirm_booking    = DoctorBooking::toBase()->where('status', global_const()::STATUS_SUCCESS)->count();

select sum(`price`) as aggregate from `doctor_bookings`
select sum(`total_charge`) as aggregate from `doctor_bookings`
select sum(`price`) as aggregate from `doctor_bookings` where date(`created_at`) >= '2026-01-01' and date(`created_at`) <= '2026-01-29'
select sum(`price`) as aggregate from `doctor_bookings` where date(`created_at`) >= '2025-12-01' and date(`created_at`) <= '2025-12-31'
---
            $booking_percent  = 100;
        }

        $total_money        = DoctorBooking::toBase()
            ->sum('price');
        $total_charges      = DoctorBooking::toBase()
            ->sum('total_charge');

        $this_month_money = DoctorBooking::toBase()
            ->whereDate('created_at', ">=", $this_month_start)
            ->whereDate('created_at', "<=", $this_month_end)
            ->sum('price');


        $last_month_money = DoctorBooking::toBase()
            ->whereDate('created_at', ">=", $last_month_start)
            ->whereDate('created_at', "<=", $last_month_end)
            ->sum('price');

select count(*) as aggregate from `user_support_tickets`
select count(*) as aggregate from `user_support_tickets` where `status` = 2
select count(*) as aggregate from `user_support_tickets` where `status` = 3
---
            ->whereDate('created_at', "<=", $last_month_end)
            ->sum('total_charge');

        $total_ticket       = (UserSupportTicket::toBase()->count() == 0) ? 1 : UserSupportTicket::toBase()->count();
        $active_ticket      = UserSupportTicket::toBase()->where('status', SupportTicketConst::ACTIVE)->count();
        $pending_ticket     = UserSupportTicket::toBase()->where('status', SupportTicketConst::PENDING)->count();

select count(*) as aggregate from `doctor_bookings` where `status` = 2 and date(`created_at`) = '2026-01-01'
select count(*) as aggregate from `doctor_bookings` where `status` = 1 and date(`created_at`) = '2026-01-01'
---
            $start_date = date('Y-m-d', $start);


            $pending = DoctorBooking::where('status', global_const()::STATUS_PENDING)
                ->whereDate('created_at', $start_date)
                ->count();
            $complete = DoctorBooking::where('status', global_const()::STATUS_SUCCESS)
                ->whereDate('created_at', $start_date)
                ->count();

select * from `doctor_bookings` order by `created_at` desc limit 3
select count(*) as aggregate from `blog_categories`
select count(*) as aggregate from `blog_categories` where `status` = 1
select count(*) as aggregate from `blog_categories` where `status` = 0
---
            'complete_data'  => $complete_data,

        ];
        $booking_data               = DoctorBooking::latest()->take(3)->get();

        $total_categories           = (BlogCategory::toBase()->count() == 0) ? 1 : BlogCategory::toBase()->count();
        $active_category            = BlogCategory::toBase()->where('status', true)->count();
        $inactive_category          = BlogCategory::toBase()->where('status', false)->count();

select count(*) as aggregate from `blogs`
select count(*) as aggregate from `blogs` where `status` = 1
select count(*) as aggregate from `blogs` where `status` = 0
---
            $category_percent = 100;
        }

        $total_blogs           = (Blog::toBase()->count() == 0) ? 1 : Blog::toBase()->count();
        $active_blog            = Blog::toBase()->where('status', true)->count();
        $inactive_blog          = Blog::toBase()->where('status', false)->count();

select * from `doctors`
select * from `users`
---
            $blog_percent = 100;
        }

        $data                       = [
            'unverified_user'       => $unverified_user,
            'active_user'           => $active_user,
            'user_percent'          => $user_percent,
            'total_user_count'      => User::all()->count(),
            'user_chart_data'       => $user_chart,

            'active_doctor'        => $active_doctor,
            'pending_doctor'       => $pending_doctor,
            'doctor_percent'       => $doctor_percent,
            'total_doctor_count'   => Doctor::all()->count(),

            'pending_booking'        => $pending_booking,
            'confirm_booking'        => $confirm_booking,
            'booking_percent'        => $booking_percent,
            'total_booking_count'    => DoctorBooking::all()->count(),
            'chart_one_data'         => $chart_one_data,
            'month_day'              => $month_day,
            'total_money'           => $total_money,
            'total_charges'         => $total_charges,
            'this_month_money'      => $this_month_money,
            'last_month_money'      => $last_month_money,