app/Http/Controllers/Admin/KnowledgeCenterController.php

select count(*) as aggregate from `knowledge_center`
---
    public function index()
    {
        $page_title = __("Knowledge Center");
        $knowledge_center = KnowledgeCenter::orderByDesc("id")->paginate(10);